-- phpMyAdmin SQL Dump
-- version 4.7.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Янв 03 2018 г., 16:51
-- Версия сервера: 10.1.25-MariaDB
-- Версия PHP: 7.1.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test`
--

-- --------------------------------------------------------

--
-- Структура таблицы `note_book`
--

CREATE TABLE `note_book` (
  `note_id` int(4) NOT NULL,
  `note_timestamp` int(11) NOT NULL,
  `note_name` varchar(100) NOT NULL,
  `note_message` varchar(4500) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `note_book`
--

INSERT INTO `note_book` (`note_id`, `note_timestamp`, `note_name`, `note_message`) VALUES
(7, 1508490000, 'Можно отдохнуть', 'Теперь можно отдохнуть столько сколько потребуется'),
(8, 1508286720, 'па', 'ен'),
(9, 1508301960, 'счсчя', 'чяссч'),
(10, 1508301960, 'счсчя', 'чяссч'),
(11, 1508301960, 'счсчя', 'чяссч'),
(12, 1508301960, 'счсчя', 'чяссч'),
(13, 1508301960, 'счсчя', 'чяссч'),
(14, 1508301960, 'счсчя', 'чяссч'),
(15, 1508301960, 'счсчя', 'чяссч'),
(16, 1508301960, 'счсчя', 'чяссч'),
(17, 1508301960, 'счсчя', 'чяссч'),
(18, 1508301960, 'счсчя', 'чяссч'),
(19, 1508301960, 'счсчя', 'чяссч'),
(20, 1508301960, 'счсчя', 'чяссч'),
(21, 1508301960, 'счсчя', 'чяссч'),
(22, 1508301960, 'счсчя', 'чяссч'),
(23, 1508301960, 'счсчя', 'чяссч'),
(24, 1508301960, 'счсчя', 'чяссч'),
(25, 1508301960, 'счсчя', 'чяссч'),
(26, 1508301960, 'счсчя', 'чяссч'),
(27, 1508301960, 'счсчя', 'чяссч'),
(28, 1508301960, 'счсчя', 'чяссч'),
(29, 1508301960, 'счсчя', 'чяссч'),
(30, 1508301960, 'счсчя', 'чяссч'),
(31, 1508301960, 'счсчя', 'чяссч'),
(32, 1508301960, 'счсчя', 'чяссч'),
(33, 1508301960, 'счсчя', 'чяссч'),
(34, 1508301960, 'счсчя', 'чяссч'),
(35, 1508301960, 'счсчя', 'чяссч'),
(36, 1508301960, 'счсчя', 'чяссч'),
(37, 1508301960, 'счсчя', 'чяссч'),
(38, 1508301960, 'счсчя', 'чяссч'),
(39, 1508301960, 'счсчя', 'чяссч'),
(40, 1508301960, 'счсчя', 'чяссч'),
(41, 1508301960, 'счсчя', 'чяссч'),
(42, 1508301960, 'счсчя', 'чяссч'),
(43, 1508301960, 'счсчя', 'чяссч'),
(44, 1508301960, 'счсчя', 'чяссч'),
(45, 1508301960, 'счсчя', 'чяссч'),
(46, 1508301960, 'счсчя', 'чяссч'),
(47, 1508301960, 'счсчя', 'чяссч'),
(48, 1508301960, 'счсчя', 'чяссч'),
(49, 1508301960, 'счсчя', 'чяссч'),
(50, 1508301960, 'счсчя', 'чяссч'),
(51, 1508301960, 'счсчя', 'чяссч'),
(52, 1508301960, 'счсчя', 'чяссч'),
(53, 1508301960, 'счсчя', 'чяссч'),
(54, 1508301960, 'счсчя', 'чяссч'),
(55, 1508301960, 'счсчя', 'чяссч'),
(56, 1508301960, 'счсчя', 'чяссч'),
(57, 1508301960, 'счсчя', 'чяссч'),
(58, 1508301960, 'счсчя', 'чяссч'),
(59, 1508301960, 'счсчя', 'чяссч'),
(60, 1508301960, 'счсчя', 'чяссч'),
(61, 1508301960, 'счсчя', 'чяссч'),
(62, 1508301960, 'счсчя', 'чяссч'),
(63, 1508301960, 'счсчя', 'чяссч'),
(64, 1508301960, 'счсчя', 'чяссч'),
(65, 1508301960, 'счсчя', 'чяссч'),
(66, 1508301960, 'счсчя', 'чяссч'),
(67, 1508301960, 'счсчя', 'чяссч'),
(68, 1508301960, 'счсчя', 'чяссч'),
(69, 1508301960, 'счсчя', 'чяссч'),
(70, 1508301960, 'счсчя', 'чяссч'),
(71, 1508301960, 'счсчя', 'чяссч'),
(72, 1508301960, 'счсчя', 'чяссч'),
(73, 1508301960, 'счсчя', 'чяссч'),
(74, 1508301960, 'счсчя', 'чяссч'),
(75, 1508301960, 'счсчя', 'чяссч'),
(76, 1508301960, 'счсчя', 'чяссч'),
(77, 1508301960, 'счсчя', 'чяссч'),
(78, 1508301960, 'счсчя', 'чяссч'),
(79, 1508301960, 'счсчя', 'чяссч'),
(80, 1508301960, 'счсчя', 'чяссч'),
(81, 1508301960, 'счсчя', 'чяссч'),
(82, 1514986680, 'Работать!', 'Нужно работать чаще!');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `note_book`
--
ALTER TABLE `note_book`
  ADD PRIMARY KEY (`note_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `note_book`
--
ALTER TABLE `note_book`
  MODIFY `note_id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=83;COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
