var hoh = `Торакс светлячка	0004DA73	Восстановление запаса сил	Затяжной урон магии	Уязвимость к магии	Повышение запаса сил
Жареная злокрысья кожа	52695	Восстановление запаса сил	Исцеление болезней	Сопротивление ядам	Восстановление здоровья
Клешня грязевого краба	0006BC00	Восстановление запаса сил	Исцеление болезней	Сопротивление ядам	Сопротивление огню
Пчела	000A9195	Восстановление запаса сил	Опустошение запаса сил	Регенерация запаса сил	Уязвимость к электричеству
Глаз саблезуба	0006BC07	Восстановление запаса сил	Опустошение здоровья	Урон магии	Восстановление здоровья
Оранжевая стрекоза	000BB956	Восстановление запаса сил	Опустошение магии	Повышение навыка: карманные кражи	Затяжной урон здоровью
Серебристый окунь	00106E1C	Восстановление запаса сил	Повреждение регенерации запаса сил	Опустошение здоровья	Сопротивление холоду
Большие рога	0006BC0A	Восстановление запаса сил	Повышение запаса сил	Замедление	Повреждение регенерации запаса сил
Медвежьи когти	0006BC02	Восстановление запаса сил	Повышение здоровья	Повышение навыка: одноручное оружие	Повреждение регенерации магии
Хисткарп	1,06E+20	Восстановление запаса сил	Повышение магии	Повреждение регенерации запаса сил	Водное дыхание
Жемчужина	000854FE	Восстановление запаса сил	Повышение навыка: блокирование	Восстановление магии	Сопротивление электричеству
Медовые соты	000B08C5	Восстановление запаса сил	Повышение навыка: блокирование	Повышение навыка: лёгкая броня	Опустошение запаса сил
Яйцо соснового дрозда	00023D6F	Восстановление запаса сил	Повышение навыка: взлом	Уязвимость к яду	Сопротивление электричеству
Маленькая жемчужина	85500	Восстановление запаса сил	Повышение навыка: одноручное оружие	Повышение навыка: восстановление	Сопротивление холоду
Пелена дымка	0006BC0E	Восстановление запаса сил	Повышение навыка: разрушение	Повышение переносимого веса	Сопротивление магии
Лиловый горноцвет	00077E1E	Восстановление запаса сил	Повышение навыка: скрытность	Затяжной урон магии	Сопротивление холоду
Толчёный бивень мамонта	0006BC10	Восстановление запаса сил	Повышение навыка: скрытность	Уязвимость к огню	Страх
Клык саблезуба	0006BC04	Восстановление запаса сил	Повышение навыка: тяжёлая броня	Повышение навыка: кузнечное дело	Уязвимость к яду
Клюв ястреба	000E7EBC	Восстановление запаса сил	Сопротивление холоду	Повышение переносимого веса	Сопротивление электричеству
Сердце даэдра	0003AD5B	Восстановление здоровья	Повреждение регенерации запаса сил	Урон магии	Страх
Пшеница	0004B0BA	Восстановление здоровья	Повышение здоровья	Повреждение регенерации запаса сил	Затяжной урон магии
Крыло монарха	727	Восстановление здоровья	Повышение искусства торговли	Затяжной урон запасу сил	Урон магии
Голубой горноцвет	00077E1C	Восстановление здоровья	Повышение навыка: колдовство	Повышение здоровья	Повреждение регенерации магии
Яйцо оригмы	0007E8C8	Восстановление здоровья	Повышение навыка: одноручное оружие	Урон запасу сил	Уязвимость к магии
Мора тапинелла	000EC870	Восстановление магии	Затяжной урон здоровью	Регенерация запаса сил	Повышение навыка: иллюзия
Красный горноцвет	00077E1D	Восстановление магии	Опустошение магии	Повышение магии	Урон здоровью
Ползучая лоза	000B2183	Восстановление магии	Повреждение регенерации запаса сил	Повышение переносимого веса	Уязвимость к магии
Вересковое сердце	0003AD61	Восстановление магии	Повышение навыка: блокирование	Паралич	Повышение магии
Эктоплазма	0003AD63	Восстановление магии	Повышение навыка: разрушение	Повышение магии	Урон здоровью
Эльфийское ухо	00034D31	Восстановление магии	Повышение навыка: стрельба	Уязвимость к холоду	Сопротивление огню
Перья ястреба	000E7ED0	Исцеление болезней	Повышение навыка: лёгкая броня	Повышение навыка: одноручное оружие	Повышение навыка: скрытность
Прах вампира	0003AD76	Невидимость	Восстановление магии	Регенерация здоровья	Исцеление болезней
Хвост злокрыса	0003AD6F	Повреждение регенерации запаса сил	Опустошение здоровья	Урон здоровью	Повышение навыка: лёгкая броня
Живица сприггана	00063B5F	Повреждение регенерации магии	Повышение навыка: зачарование	Повышение навыка: кузнечное дело	Повышение навыка: изменение
Коготь ворожеи	0006B689	Сопротивление магии	Затяжной урон магии	Повышение навыка: зачарование	Повышение искусства торговли
Куриное яйцо	00023D77	Сопротивление магии	Повреждение регенерации магии	Водное дыхание	Затяжной урон запасу сил
Лаванда	00045C28	Сопротивление магии	Повышение запаса сил	Опустошение магии	Повышение навыка: колдовство
Пушица	0003F7F8	Сопротивление магии	Повышение магии	Повышение навыка: блокирование	Повышение искусства торговли
Язык дракона	000889A2	Сопротивление огню	Повышение искусства торговли	Повышение навыка: иллюзия	Повышение навыка: двуручное оружие
Мухомор	0004DA00	Сопротивление огню	Повышение навыка: двуручное оружие	Бешенство	Регенерация запаса сил
Снежные ягоды	0001B3BD	Сопротивление огню	Повышение навыка: зачарование	Сопротивление холоду	Сопротивление электричеству
Чешуя рыбы-убийцы	0003AD70	Сопротивление холоду	Затяжной урон здоровью	Повышение навыка: тяжёлая броня	Повышение навыка: блокирование
Ветка чертополоха	000134AA	Сопротивление холоду	Опустошение запаса сил	Сопротивление ядам	Повышение навыка: тяжёлая броня
Морозная мириам	00034D32	Сопротивление холоду	Повышение навыка: скрытность	Опустошение магии	Повреждение регенерации запаса сил
Болотный стручок	0007E8B7	Сопротивление электричеству	Затяжной урон магии	Паралич	Восстановление здоровья
Синяя стрекоза	000E4F0C	Сопротивление электричеству	Повышение навыка: карманные кражи	Восстановление здоровья	Страх
Светящийся гриб	0007EE01	Сопротивление электричеству	Повышение навыка: разрушение	Повышение навыка: кузнечное дело	Повышение здоровья
Травяной стручок	8,3E+65	Сопротивление ядам	Опустошение магии	Повышение навыка: изменение	Восстановление магии
Чеснок	00034D22	Сопротивление ядам	Повышение запаса сил	Регенерация магии	Регенерация здоровья
Жир тролля	0003AD72	Сопротивление ядам	Повышение навыка: двуручное оружие	Бешенство	Урон здоровью
Икра рыбы-убийцы	0007E8C5	Сопротивление ядам	Повышение навыка: карманные кражи	Затяжной урон здоровью	Повышение запаса сил
Пчелиное гнездо	000A9191	Сопротивление ядам	Повышение навыка: лёгкая броня	Повышение навыка: скрытность	Повышение навыка: разрушение
Лютый гриб	0004DA25	Урон запасу сил	Бешенство	Восстановление здоровья	Повышение навыка: кузнечное дело
Паучье яйцо	0009151B	Урон запасу сил	Повреждение регенерации магии	Повышение навыка: взлом	Повышение навыка: стрельба
Палец великана	0003AD64	Урон запасу сил	Повышение здоровья	Повышение переносимого веса	Повреждение регенерации запаса сил
Сиродильский лопатохвост	1,06E+21	Урон запасу сил	Повышение навыка: восстановление	Страх	Опустошение здоровья
Крыло синей бабочки	000727DE	Урон запасу сил	Повышение навыка: колдовство	Повреждение регенерации магии	Повышение навыка: зачарование
Собачий корень	0006ABCB	Урон запасу сил	Повышение навыка: одноручное оружие	Повышение навыка: стрельба	Паралич
Костная мука	00034CDD	Урон запасу сил	Сопротивление огню	Повышение навыка: колдовство	Опустошение запаса сил
Ухо фалмера	0003AD5D	Урон здоровью	Бешенство	Сопротивление ядам	Повышение навыка: взлом
Бесовский гриб	0004DA23	Урон здоровью	Затяжной урон здоровью	Паралич	Восстановление здоровья
Ядовитый колокольчик	000516C8	Урон здоровью	Опустошение запаса сил	Замедление	Уязвимость к яду
Человечье мясо	001016B3	Урон здоровью	Паралич	Восстановление магии	Повышение навыка: скрытность
Паслён	0002F44C	Урон здоровью	Повреждение регенерации магии	Затяжной урон запасу сил	Повышение навыка: разрушение
Бойцовая рыбка	00106E1A	Урон здоровью	Повышение навыка: изменение	Замедление	Повышение переносимого веса
Корень Нирна	00059B86	Урон здоровью	Урон запасу сил	Невидимость	Сопротивление магии
Человеческое сердце	000B18CD	Урон здоровью	Урон магии	Повреждение регенерации магии	Бешенство
Морской жёлудь	0007EDF5	Урон магии	Водное дыхание	Регенерация здоровья	Повышение навыка: карманные кражи
Светящаяся пыль	0003AD73	Урон магии	Повреждение регенерации магии	Повышение навыка: разрушение	Сопротивление электричеству
Бородатый мох	00057F91	Урон магии	Повышение здоровья	Повреждение регенерации магии	Повышение навыка: одноручное оружие
Гниль Намиры	0004DA24	Урон магии	Повышение навыка: взлом	Страх	Регенерация здоровья
Перья ворожеи	0003AD66	Урон магии	Повышение навыка: колдовство	Бешенство	Уязвимость к электричеству
Крыло лунного мотылька	000727DF	Урон магии	Повышение навыка: лёгкая броня	Регенерация здоровья	Невидимость
Виноград Джазби	0006AC4A	Уязвимость к магии	Повышение магии	Регенерация магии	Опустошение здоровья
Соль	00034CDF	Уязвимость к магии	Повышение навыка: восстановление	Замедление	Регенерация магии
Чешуйчатка	0006F950	Уязвимость к магии	Повышение навыка: иллюзия	Регенерация запаса сил	Повышение переносимого веса
Двемерское масло	000F11C0	Уязвимость к магии	Повышение навыка: иллюзия	Регенерация магии	Восстановление магии
Стержневой корень	0003AD71	Уязвимость к магии	Повышение навыка: иллюзия	Регенерация магии	Восстановление магии
Кровавый венец	0004DA20	Уязвимость к огню	Повышение навыка: блокирование	Уязвимость к яду	Сопротивление магии
Ягоды можжевельника	0005076E	Уязвимость к огню	Повышение навыка: стрельба	Регенерация здоровья	Повреждение регенерации запаса сил
Морозная соль	0003AD5F	Уязвимость к огню	Сопротивление холоду	Восстановление магии	Повышение навыка: колдовство
Лунный сахар	000D8E3F	Уязвимость к огню	Сопротивление холоду	Восстановление магии	Регенерация магии
Абесинский окунь	00106E1B	Уязвимость к холоду	Повышение навыка: скрытность	Уязвимость к яду	Повышение навыка: восстановление
Белянка	0004DA22	Уязвимость к холоду	Повышение навыка: тяжёлая броня	Восстановление магии	Опустошение магии
Зубы ледяного привидения	0003AD6A	Уязвимость к холоду	Повышение навыка: тяжёлая броня	Невидимость	Уязвимость к огню
Огненная соль	0003AD5E	Уязвимость к холоду	Сопротивление огню	Восстановление магии	Регенерация магии
Гигантский лишайник	0007E8C1	Уязвимость к электричеству	Опустошение здоровья	Уязвимость к яду	Восстановление магии
Соль пустоты	0003AD60	Уязвимость к электричеству	Сопротивление магии	Урон здоровью	Повышение магии
Яйцо коруса	0003AD56	Уязвимость к яду	Повышение запаса сил	Урон магии	Невидимость
Маленькие рога	0006BC0B	Уязвимость к яду	Повышение навыка: восстановление	Затяжной урон запасу сил	Урон здоровью
Жёлтый горноцвет	XX002A78	Сопротивление ядам	Повышение здоровья	Повышение навыка: восстановление	Повреждение регенерации запаса сил
Крыло мотылька предка	XX0059BA	Урон запасу сил	Повышение навыка: колдовство	Повреждение регенерации магии	Повышение навыка: зачарование
Светящийся цветок	XX00B097	Сопротивление магии	Страх	Регенерация здоровья	Паралич
Усик коруса-охотника	XX0183B7	Урон запасу сил	Повышение навыка: колдовство	Повреждение регенерации магии	Повышение навыка: зачарование
Ядовитый цветок	XX0185FB	Урон здоровью	Страх	Повышение переносимого веса	Замедление
Лососёвая икра	XX003545	Водное дыхание	Повышение магии	Регенерация магии	Восстановление запаса сил
Яйцо ястреба	XX00F1CC	Сопротивление магии	Водное дыхание	Повреждение регенерации магии	Затяжной урон запасу сил
Вредозобник	XX017E97	Опустошение здоровья	Опустошение запаса сил	Опустошение магии	Затяжной урон здоровью
Древесина горелого сприггана	XX01CD6E	Уязвимость к огню	Повышение навыка: изменение	Повреждение регенерации магии	Замедление
Желе нетча	XX01CD72	Паралич	Повышение переносимого веса	Восстановление запаса сил	Страх
Желе пепельного прыгуна	XX01CD71	Восстановление здоровья	Повышение навыка: лёгкая броня	Сопротивление электричеству	Уязвимость к холоду
Императорский зонтичный мох	XX01FF75	Урон здоровью	Повышение магии	Регенерация здоровья	Повышение навыка: двуручное оружие
Кабаний клык	XX01CD6F	Повышение запаса сил	Повышение здоровья	Повышение навыка: блокирование	Бешенство
Корень трамы	XX017008	Уязвимость к электричеству	Повышение переносимого веса	Урон магии	Замедление
Пепел порождения	XX01CD6D	Опустошение запаса сил	Сопротивление огню	Повышение навыка: зачарование	Опустошение магии
Пепельная ползучая лоза	XX01CD74	Урон запасу сил	Невидимость	Сопротивление огню	Повышение навыка: разрушение
Перья фельсадской крачки	XX03CD8E	Восстановление здоровья	Повышение навыка: лёгкая броня	Исцеление болезней	Сопротивление магии
Стручок пепельной травы	XX016E26	Сопротивление огню	Уязвимость к электричеству	Повышение навыка: взлом	Повышение навыка: скрытность`;
var ingridObj = {};
var effectsObj = {};
var commonEffects = {};
var maxMatches = {
	'1': [],
	'2': [],
	'3': [],
	'4': [],
	
}

function getPotionEffects() {
	var activeEffects = {};
	var potentialEffects = {};
	for (var i = 0; i < arguments.length; i++) {
		var ingridEffects = ingridObj[arguments[i]];
		for (var effect in ingridEffects) {
			if (effect in potentialEffects) {
				activeEffects[effect] = 1;
			} else {
				potentialEffects[effect] = 1;
			}
		}
	}
	return activeEffects;
}


function calcBestCombinations(listOfIngridients) {
	var comboEffects = {};
	var maxEffects = {
		'1' : {},
		'2' : {},
		'3' : {},
		'4' : {},
		'5' : {},
	};
	
	for (var i in listOfIngridients) {
		for (var n in listOfIngridients) {
			if (n === i) continue;
			for (var k in listOfIngridients) {
				if (k === n || k === i) continue;
				var pair1Id = ( [i, n].sort().join(', ') );
				var pair2Id = ( [i, k].sort().join(', ') );
				var pair3Id = ( [k, n].sort().join(', ') );
				var trioId = ( [i, n, k].sort().join(', ') );
				if (!(pair1Id in comboEffects)) {
					comboEffects[pair1Id] = getPotionEffects(i, n);
					var pair1EffCount = Object.keys(comboEffects[pair1Id]).length;
					if (pair1EffCount > 0) {
						maxEffects[pair1EffCount][pair1Id] = comboEffects[pair1Id];
					}
				}
				if (!(pair2Id in comboEffects)) {
					comboEffects[pair2Id] = getPotionEffects(i, k);
					var pair2EffCount = Object.keys(comboEffects[pair2Id]).length;
					if (pair2EffCount > 0) {
						maxEffects[pair2EffCount][pair2Id] = comboEffects[pair2Id];
					}
				}
				if (!(pair3Id in comboEffects)) {
					comboEffects[pair3Id] = getPotionEffects(k, n);
					var pair3EffCount = Object.keys(comboEffects[pair3Id]).length;
					if (pair3EffCount > 0) {
						maxEffects[pair3EffCount][pair3Id] = comboEffects[pair3Id];
					}
				}
				if (!(trioId in comboEffects)) {
					comboEffects[trioId] = getPotionEffects(i, n, k);
					var trioEffCount = Object.keys(comboEffects[trioId]).length;
					if (
							trioEffCount > 1 
							&& trioEffCount > pair1EffCount 
							&& trioEffCount > pair2EffCount
							&& trioEffCount > pair3EffCount
					) {
						maxEffects[trioEffCount][trioId] = comboEffects[trioId];
					}
				}
			}
		}
	}
	return maxEffects;
}


hoh.split('\n').forEach(function(ingrStr) {
	var ingrArr = ingrStr.split('\t');
	ingridObj[ingrArr[0]] = {};
	for (var i = 2; i < 6; i++) {
		ingridObj[ingrArr[0]][ingrArr[i]] = 1;
		var commonEffectsWith = {};
		if (ingrArr[0] in commonEffects) {
			commonEffectsWith = commonEffects[ingrArr[0]];
		} else {
			commonEffects[ingrArr[0]] = commonEffectsWith;
		}
		if (!(ingrArr[i] in effectsObj)) {
			effectsObj[ingrArr[i]] = {};
		} else {
			for (var commIngr in effectsObj[ingrArr[i]]) {
				if (!(commIngr in commonEffectsWith)) {
					commonEffectsWith[commIngr] = {
						commonEffectsCount : 0,
						commonEffects: {}
					};
				}
				commonEffectsWith[commIngr].commonEffectsCount++;
				commonEffectsWith[commIngr].commonEffects[ingrArr[i]] = 1;
				maxMatches[commonEffectsWith[commIngr].commonEffectsCount].push([ingrArr[0], commIngr]);
			}
		}
		effectsObj[ingrArr[i]][ingrArr[0]] = 1;
	}
});



console.log(calcBestCombinations(ingridObj));
'^.*$','"$0":1,';



